
/**
 * 1-> 数据校验
 *
 * 3->权限相关
 * 
 * 4->支付相关
 *
 * 6->业务逻辑
 * 
 * 9->系统错误
 */

export default {
  //登陆错误
  10000:"未知错误",
  10001:'账号不存在',
  10002:'验证码错误',
  10003:'bannerId不存在',
  10004:'未找到数据',
  10005:'token已过期',
  10009:'商品人次不足，订单创建失败',
  10010:'号码发放失败',
  13300:'支付状态修改失败',
  
  30000:'未登陆',

  // 业务错误
  60001:'openId参数有误',
  60002:'从复点赞',
  60003:'没有抽奖次数了',
  60004:'支付方法不存在',
  60005:'payment已过期',
  60006:'订单缓存失败',
  60007:'库存不足，无法购买',
  
  //支付中心异常
  70009:'商户没有APP支付权限',
  
  90000:'接口未找到',
  90001:'无法响应请求方法'
}



//import x from './validaerror'
//export default {
//	//登陆错误
//	10001:'账号不存在',
//	10002:'验证码错误',
//	10003:'token已过期',
//	{...x}
//}
